#2) 
# მომხმარებლისგან მონაცემების მიღება
Name = input("შეიყვანეთ თქვენი სახელი: ")
Surname = input("შეიყვანეთ თქვენი გვარი: ")
Age = input("შეიყვანეთ თქვენი ასაკი: ")
State = input("შეიყვანეთ თქვენი ქალაქი: ")

# შედეგის დაბეჭდვა ერთ წინადადებად
print(f"{Name} {Surname} is {Age} years old and lives in {State}.")



#3)
# ცელსიუსის ტემპერატურა
Celsius = 25  # შეგიძლიათ სხვა მთელ რიცხვადაც ჩასვათ

# ფარენჰეიტში გადაყვანა
Fahrenheit = (Celsius * 9/5) + 32

# კელვინში გადაყვანა
Kelvin = Celsius + 273.15

# შედეგის დაბეჭდვა
print("ცელსიუსი:", Celsius)
print("ფარენჰეიტი:", Fahrenheit)
print("კელვინი:", Kelvin)



#4
#მიმატება
print(3 + 5)
print(10 + 20)
print(-4 + 7)
print(100 + 200)
print(0 + 99)

#გამოკლება
print(10 - 3)
print(20 - 30)
print(-5 - 5)
print(50 - 25)
print(100 - 0)

#გამრავლება
print(4 * 5)
print(-3 * 7)
print(0 * 100)
print(12 * 12)
print(8 * -2)

#გაყოფა
print(10 / 2)
print(9 / 3)
print(7 / 2)
print(100 / 5)
print(1 / 4)

#ნაშთიანი გაყოფა
print(10 % 3)
print(15 % 4)
print(9 % 2)
print(100 % 9)
print(7 % 7)

#ხარისხში აყვანა
print(2 ** 3)
print(5 ** 2)
print(10 ** 0)
print(3 ** 4)
print(9 ** 1)

#მთელი რიცხვით გაყოფა
print(10 // 3)
print(20 // 6)
print(100 // 9)
print(7 // 2)
print(50 // 10)


# / - ჩვეულებრივი გაყოფა (მიღებული პასუხი ყოველთვის რიცხვია ათწილადი ფორმით)
print(7 / 2)  # პასუხი: 3.5
print(10 / 4) # პასუხი: 2.5

# // - მთელი რიცხვით გაყოფა (იხსნება მხოლოდ მთელი ნაწილი, რაც დარჩება წილმომდევნო ნაწილამდე)
print(7 // 2)  # პასუხი: 3 (არ ჩანს .5, მხოლოდ მთელი ნაწილი)
print(10 // 4) # პასუხი: 2

# % - ნაშთიანი გაყოფა (განაპირობებს იმ რიცხვს რაც რჩება გაყოფის შემდეგ)
print(7 % 2)  # პასუხი: 1 (2*3 = 6, ნაშთი 1)
print(10 % 4) # პასუხი: 2 (4*2 = 8, ნაშთი 2)



