"""2) შექმენით ცვლადი balance, რომლის მნიშვნელობასაც განაახლებთ და ძველ მნიშვნელობას დაუმატებთ 50-ს, ასევე შექმენით 1 ტექსტური ცვლადი რომელშიც შეინახავთ კონტინენტს, დაადეკლარირეთ height ცვლადი რომელშიც შეინახავთ ათწილად რიცხვს (float) დაბეჭდეთ სამივე ცვლადის მონაცემთა ტიპი. შემდეგ დაბეჭდეთ ყველა ართიმეტიკული ოპერაციის შედეგი 2 რიცხვს შორის"""

balance = 35
balance = 50 + balance
print(balance)

continent = "Antarctica"
height = 0.20

print(type(balance))
print(type(continent))
print(type(height))

