#1) შექმენით ცვლადი რომელშიც შეინახავთ მომხმარებლის ანგარიშის ემაილს, კომენმტარებით ახსენით თუ რატომ არ ვწერთ ამ ცვლადის სახელის სიტყვებს შეერთებულად და რა ქვია იმ მიდგომას რომელსაც თქვენ იყენებთ, ასევე დაწერეთ თქვენი სიტყვებით თუ რა არის ცვლადი და ჩამოწერეთ მისი შექმნის ნაბიჯები (3), საობლოოდ შექმენით ცვლადი number შემდეგ შეცვალეთ მისი მნიშვნელობა Number = 10-ით, საბოლოოდ კი NuMBEr = 20-ით და დაბეჭდეთ ეს მნიშვნელობა აღწერეთ რა შედეგი მიიღეთ და რატომ რას ნიშნავს python არის case senseitive

#აქ ვქმნი ცვლადს, რომელშიც ვინახავ მომხმარებლის ელფოსტას
user_email = "iliatabatadze45@gmail.com"

#ცვლადის სახელის დროს არ ვწერთ სიტყვებს ერთმანეთს შეერთებულად (მაგალითად: useremail), რადგან ასეთ შემთხვევაში კოდის წაკითხვა რთული ხდება. 
#მაგ: user_email უფრო მკაფიოდ ჩანს, რომ ეს არის "მომხმარებლის ელფოსტა". ამ მიდგომას ეწოდება snake_case – თითოეული სიტყვა ქვედა ტირეთია გამოყოფილი.

#ცვლადი არის სახელის მქონე ადგილი მეხსიერებაში, სადაც შეგვიძლია მოვათავსოთ მონაცემები და მოგვიანებით გამოვიყენოთ ისინი კოდში Print - ის  მეშვეობით.

#ცვლადის შექმნის სამი ძირითადი ნაბიჯი:                                                                                                          
#1) შევარჩიოთ სახელი (მაგ: user_email)                                                                                                           
#2) დავნიშნოთ მნიშვნელობა.(მაგ:"iliatabatadze45@gmailcom")                                                                                                     #3) გამოვიყენოთ კოდი საჭიროების მიხედვით.

#ცვლადის შეცვლა და case sensitivity მაგალითი
number = 5          # small letters - number არის 5
Number = 10         # პირველი ასო დიდი - Python განსხვავებულად აღიქვამს
NuMBEr = 20         # ცვლადის სახელი ისევ განსხვავებულია

print(NuMBEr)       # დაბეჭდავს 20 რადგან Python არის Case sensitive language და სხვადასხვანაირად აღიქვავს დიდ და პატარა ასოებს HTML - ისგან განსხვავებით

print("Ilia" + str(16))