#10) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

#3 ცვლადი სხვადასხვა მონაცემთა ტიპით
name = "Ilia"       #str → ტექსტი
age = 16            #int → მთელი რიცხვი
height = 1.83       #float → ათწილად რიცხვი

# type() ფუნქციის გამოყენებით ვამოწმებთ თითოეული ცვლადის ტიპს
print("ცვლადის 'name' ტიპია:", type(name))
print("ცვლადის 'age' ტიპია:", type(age))
print("ცვლადის 'height' ტიპია:", type(height))
