#11) მომხმარებელს შემოატანინეთ თავისი ასაკი, შემდეგ შემოატანინეთ წლების რაოდენობა. მიღებული ინფორმაცია შეინახეთ ცვლადებში და გამოითვალეთ, რამდენი წლის იქნება მომხმარებელი y (მომხმარებლის მიერ შემოტანილი) წლის შემდეგ. საბოლოოდ გამოუტანეთ შედეგი შემდეგი სახით: "[წლები] წლის შემდეგ თქვენ იქნებით [მომავალი ასაკი] წლის". დავალების შესასრულებლად გამოიყენეთ მონაცემთა ტიპების ხელოვნურად შეცვლის მეთოდები: int() - რომ შეასრულოთ ართიმეტიკული მოქმედებები, str() - რომ დაბეჭდოთ შედეგი შეცდომების გარეშე

#მომხმარებლის ასაკის მიღება (input() ყოველთვის string აბრუნებს)
current_age = input("შეიყვანეთ თქვენი ასაკი: ")

#წლების რაოდენობის მიღება
years_to_add = input("შეიყვანეთ რამდენი წლის შემდეგ გსურთ თქვენი ასაკის რაოდენობის გაგება: ")

#მონაცემების ტიპის შეცვლა string → int, რომ შეგვეძლოს მათემატიკური მოქმედება
current_age = int(current_age)
years_to_add = int(years_to_add)

#მომავალი ასაკის გამოთვლა
future_age = current_age + years_to_add

#შედეგის დაბეჭდვა, int → string კონვერტაციის გამოყენებით
print(str(years_to_add) + " წლის შემდეგ თქვენ იქნებით " + str(future_age) + " წლის.")
